Vimalananth/STM32-EC200-Firmware/src/ota.c
/* ota.c — OTA firmware update state machine
 *
 * AT command sequence:
 *   AT+QHTTPURL=<len>,30    → wait "CONNECT" prompt → send URL → wait OK
 *   AT+QHTTPGET=80          → wait +QHTTPGET: 0,200,<size>
 *   AT+QFOPEN="HTTP_GETFILE",0  → wait +QFOPEN: 0
 *   loop:
 *     AT+QFREAD=0,256       → wait "CONNECT N" header
 *     <N bytes binary data> → accumulate via OTA_FeedByte()
 *     flash N bytes to Slot B
 *   AT+QFCLOSE=0
 *   write OTA flags to 0x0801E000
 *   NVIC_SystemReset()
 */

#include "ota.h"
#include "main.h"    /* IWDG handle */
#include "stm32g0xx_hal.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>

/* ── External handles ───────────────────────────────────────────────────── */
extern IWDG_HandleTypeDef hiwdg;

/* ── Private config ─────────────────────────────────────────────────────── */
#define OTA_CHUNK_SIZE   256U          /* bytes per AT+QFREAD request       */
#define OTA_HTTP_FILE    "HTTP_GETFILE"
#define OTA_STATUS_TOPIC "pump/01/ota/status"
#define OTA_PROGRESS_EVERY (4096U)     /* publish progress every 4 KB       */
#define OTA_CMD_TIMEOUT_MS 120000UL  /* 120 s for HTTP GET; modem given 110 s (see OTA_StartFromGet) */
#define OTA_READ_TIMEOUT_MS 10000UL   /* 10 s per chunk read               */

/* ── State machine ──────────────────────────────────────────────────────── */
typedef enum {
    OTA_ST_IDLE,
    OTA_ST_SSL_ENABLE,      /* sent AT+QHTTPCFG="ssl",1, waiting OK          */
    OTA_ST_SSL_SECLEVEL,    /* sent AT+QSSLCFG="seclevel",1,1, waiting OK   */
    OTA_ST_SSL_CACERT,      /* sent AT+QSSLCFG="cacert",1,"cacert.pem", waiting OK */
    OTA_ST_SSL_VERSION,     /* sent AT+QSSLCFG="sslversion",1,4, waiting OK  */
    OTA_ST_SSL_CIPHER,      /* sent AT+QSSLCFG="ciphersuite",1,0xFFFF, waiting OK */
    OTA_ST_SSL_CTXID,       /* sent AT+QHTTPCFG="sslctxid",1, waiting OK     */
    OTA_ST_HTTP_URL_CMD,    /* sent AT+QHTTPURL, waiting for CONNECT prompt  */
    OTA_ST_HTTP_URL_BODY,   /* sent URL text, waiting for OK                 */
    OTA_ST_HTTP_GET,        /* sent AT+QHTTPGET, waiting for +QHTTPGET URC   */
    OTA_ST_HTTP_READFILE,   /* sent AT+QHTTPREADFILE, waiting completion     */
    OTA_ST_FILE_OPEN,       /* sent AT+QFOPEN, waiting for +QFOPEN handle    */
    OTA_ST_CHUNK_READ,      /* sent AT+QFREAD, waiting for CONNECT N header  */
    OTA_ST_CHUNK_BINARY,    /* receiving N raw bytes via OTA_FeedByte()      */
    OTA_ST_CHUNK_FLASH,     /* writing chunk to App Slot B                   */
    OTA_ST_FILE_CLOSE,      /* sent AT+QFCLOSE, waiting for OK               */
    OTA_ST_FLAG_WRITE,      /* writing OTA flags to flash                    */
    OTA_ST_REBOOT,          /* published status, waiting to reset            */
    OTA_ST_ERROR,           /* terminal error state                          */
} OTA_State;

/* ── Private state ──────────────────────────────────────────────────────── */
static OTA_State    ota_state        = OTA_ST_IDLE;
static char         ota_url[256];
static uint32_t     ota_file_size    = 0;
static uint32_t     ota_offset       = 0;     /* bytes written to Slot B so far */
static uint32_t     ota_crc32        = 0xFFFFFFFFUL;
static uint32_t     ota_last_progress= 0;     /* offset at last progress publish */
static uint32_t     ota_state_ms     = 0;     /* time entered current state      */
static uint32_t     ota_timeout_ms   = 0;
static int          ota_file_handle  = -1;
static bool         qfopen_sent      = false;  /* true after AT+QFOPEN is sent */

/* Binary accumulation buffer (for AT+QFREAD raw response) */
static uint8_t      ota_bin_buf[OTA_CHUNK_SIZE];
static uint32_t     ota_bin_pos      = 0;
static uint32_t     ota_bin_expect   = 0;     /* bytes still to receive          */

/* Callbacks set by modem.c */
static OTA_SendFn    ota_send_fn    = 0;
static OTA_PublishFn ota_publish_fn = 0;

/* ── CRC32 (standard IEEE 802.3 / PKZIP polynomial 0xEDB88320) ──────────── */
static uint32_t crc32_update(uint32_t crc, const uint8_t *data, uint32_t len)
{
    for (uint32_t i = 0; i < len; i++) {
        crc ^= data[i];
        for (int j = 0; j < 8; j++)
            crc = (crc >> 1) ^ (0xEDB88320UL & -(crc & 1));
    }
    return crc;
}

/* ── AT helpers ─────────────────────────────────────────────────────────── */
static void ota_send(const char *cmd)
{
    if (ota_send_fn) {
        ota_send_fn(cmd);
        ota_send_fn("\r\n");
    }
}

static void ota_publish(const char *payload)
{
    if (ota_publish_fn)
        ota_publish_fn(OTA_STATUS_TOPIC, payload);
}

static void ota_enter(OTA_State s, uint32_t timeout_ms)
{
    ota_state      = s;
    ota_state_ms   = HAL_GetTick();
    ota_timeout_ms = timeout_ms;
    char dbg[64];
    snprintf(dbg, sizeof(dbg), "[OTA] Enter state %d, timeout %lu ms\r\n", s, (unsigned long)timeout_ms);
    Debug_Print(dbg);

}

static void ota_error(const char *reason)
{
    char msg[128];
    snprintf(msg, sizeof(msg), "{\"ota_status\":\"error\",\"reason\":\"%s\"}", reason);
    ota_publish(msg);
    /* Cancel any pending HTTP session so the modem is free for MQTT reconnect.
     * Without this, AT+QMTCLOSE / AT+QIDEACT are ignored while the modem is
     * still waiting for AT+QHTTPGET to complete, leaving the board stuck offline. */
    ota_send("AT+QHTTPSTOP");
    ota_enter(OTA_ST_ERROR, 0);
    char dbg[64];
    snprintf(dbg, sizeof(dbg), "[OTA] Error: %s\r\n", reason);
    Debug_Print(dbg);
}

static bool ota_have_file_handle(void)
{
    if (ota_file_handle >= 0)
        return true;
    ota_error("bad file handle");
    return false;
}

static void ota_send_read_chunk(void)
{
    char cmd[48];
    if (!ota_have_file_handle())
        return;
    snprintf(cmd, sizeof(cmd), "AT+QFREAD=%d,%u",
             ota_file_handle, (unsigned)OTA_CHUNK_SIZE);
    ota_send(cmd);
}

static void ota_send_close_file(void)
{
    char cmd[32];
    if (!ota_have_file_handle())
        return;
    snprintf(cmd, sizeof(cmd), "AT+QFCLOSE=%d", ota_file_handle);
    ota_send(cmd);
}

