Vimalananth/STM32-EC200-Firmware/src/ota.c
    switch (ota_state) {

    case OTA_ST_FILE_OPEN:
        /* Send AT+QFOPEN after a 2 s settle — the EC200U's UFS write started
         * by AT+QHTTPREADFILE may not be fully committed when the
         * +QHTTPREADFILE: 0 URC arrives.  Waiting 2 s before sending QFOPEN
         * ensures the file is accessible without polling or retry logic.   */
        if (!qfopen_sent &&
            (int32_t)(HAL_GetTick() - ota_state_ms) >= 2000)
        {
            char cmd[64];
            snprintf(cmd, sizeof(cmd), "AT+QFOPEN=\"%s\",0", OTA_HTTP_FILE);
            ota_send(cmd);
            qfopen_sent = true;
            Debug_Print("[OTA] AT+QFOPEN sent after 2s settle\r\n");
        }
        break;

    case OTA_ST_CHUNK_FLASH: {
        /* Flash the accumulated binary chunk to App Slot B */
        uint32_t chunk_len = ota_bin_pos;
        uint32_t dst       = OTA_SLOT_B_ADDR + ota_offset;

        /* Erase page if we're at a page boundary */
        if ((ota_offset % OTA_PAGE_SIZE) == 0) {
            HAL_FLASH_Unlock();
            if (!flash_erase_page(dst)) {
                HAL_FLASH_Lock();
                ota_error("flash erase failed");
                break;
            }
        } else {
            HAL_FLASH_Unlock();
        }

        if (!flash_write_chunk(dst, ota_bin_buf, chunk_len)) {
            HAL_FLASH_Lock();
            ota_error("flash write failed");
            break;
        }
        HAL_FLASH_Lock();

        /* Update running CRC32 and offset */
        ota_crc32   = crc32_update(ota_crc32, ota_bin_buf, chunk_len);
        ota_offset += chunk_len;
        HAL_IWDG_Refresh(&hiwdg);

        /* Publish progress every 4 KB */
        if (ota_offset - ota_last_progress >= OTA_PROGRESS_EVERY ||
            ota_offset >= ota_file_size)
        {
            ota_last_progress = ota_offset;
            char msg[96];
            snprintf(msg, sizeof(msg),
                     "{\"ota_status\":\"flashing\",\"progress\":%lu,\"total\":%lu}",
                     (unsigned long)ota_offset, (unsigned long)ota_file_size);
            ota_publish(msg);
        }

        /* More data to read? */
        if (ota_offset < ota_file_size) {
            ota_send_read_chunk();
            ota_enter(OTA_ST_CHUNK_READ, OTA_READ_TIMEOUT_MS);
        } else {
            /* All chunks received — close file */
            ota_send_close_file();
            ota_enter(OTA_ST_FILE_CLOSE, 5000);
            ota_publish("{\"ota_debug\":\"All chunks received, closing file\"}");
        }
        break;
    }

    case OTA_ST_FLAG_WRITE: {
        /* Finalize CRC32 */
        uint32_t final_crc = ota_crc32 ^ 0xFFFFFFFFUL;

        /* Erase OTA flags page (2 KB at 0x0801E000) */
        FLASH_EraseInitTypeDef er = {
            .TypeErase = FLASH_TYPEERASE_PAGES,
            .Banks     = FLASH_BANK_1,
            .Page      = (OTA_FLAGS_ADDR - FLASH_BASE) / OTA_PAGE_SIZE,
            .NbPages   = 1
        };
        uint32_t err;
        HAL_FLASH_Unlock();
        HAL_IWDG_Refresh(&hiwdg);
        if (HAL_FLASHEx_Erase(&er, &err) != HAL_OK || err != 0xFFFFFFFFUL) {
            HAL_FLASH_Lock();
            ota_error("flags erase failed");
            break;
        }

        /* Write two 64-bit words: [magic, size] and [crc32, reserved] */
        uint64_t word0, word1;
        uint32_t w0[2] = { OTA_MAGIC,  ota_file_size };
        uint32_t w1[2] = { final_crc,  0xFFFFFFFFUL  };
        memcpy(&word0, w0, 8);
        memcpy(&word1, w1, 8);

        bool ok = (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, OTA_FLAGS_ADDR,     word0) == HAL_OK) &&
                  (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, OTA_FLAGS_ADDR + 8, word1) == HAL_OK);
        HAL_FLASH_Lock();
        HAL_IWDG_Refresh(&hiwdg);

        if (!ok) { ota_error("flags write failed"); break; }

        ota_publish("{\"ota_status\":\"rebooting\"}");
        ota_enter(OTA_ST_REBOOT, 1000);
        break;
    }

    case OTA_ST_REBOOT:
        /* Wait 1 s so the MQTT publish can complete, then tear down the
         * EC200U HTTP/TLS session and PDP context BEFORE resetting.
         * Without this, the modem's TLS heap remains fragmented from the
         * HTTPS download and AT+QMTOPEN cannot allocate SSL buffers on the
         * next boot — causing the post-OTA MQTT reconnect to fail silently.
         * Power-cycling always works because the modem fully reinitialises;
         * this replicates that cleanup while keeping the STM32 in control. */
        if (HAL_GetTick() - ota_state_ms >= 1000) {
            /* Stop the HTTP session — releases TLS context 1 heap */
            ota_send("AT+QHTTPSTOP");
            for (int i = 0; i < 6; i++) { HAL_Delay(500); IWDG->KR = 0xAAAAU; }   /* 3 s */
            /* Deactivate PDP — forces complete bearer teardown */
            ota_send("AT+QIDEACT=1");
            for (int i = 0; i < 10; i++) { HAL_Delay(500); IWDG->KR = 0xAAAAU; }  /* 5 s */
            NVIC_SystemReset();
        }
        break;

    default:
        break;
    }
}
